import React from 'react';

import Comments from './Comments';

export type ParamProps = {
  params: {
    id: string;
  };
};

const DetailPage = async ({ params }: ParamProps) => {
  return (
    <div className="relative max-w-[1300px] mx-auto">
      <button className="absolute top-[15rem] bg-gray-400 px-1 py-1 rounded-full text-[1.5rem]">❤️</button>
      <div className="flex flex-col items-center">
        <h1 className="my-10 text-[2rem] font-medium">기사 제목</h1>
        <div className="bg-gray-500 w-[550px] h-[320px]"></div>
        <p className="max-w-[800px] mt-16">
          뉴욕 양키스가 2022년 이후 2년 만에 미국프로야구 메이저리그(MLB)
          아메리칸리그 챔피언십시리즈(ALCS·7전4승제)에 진출했습니다. 양키스는
          오늘(11일) 미국 미주리주 캔자스시티 카우프먼 스타디움에서 열린
          캔자스시티 로열스와 아메리칸리그 디비전시리즈(ALDS·5전 3승제) 4차전에서
          3대 1로 이겼습니다. 상대 전적 3승 1패로 ALDS를 통과한 양키스는
          클리블랜드 가디언스-디트로이트 타이거스전 승자와 14일 ALCS 1차전에
          나섭니다. 양키스는 1회초 클레이버 토레스, 후안 소토의 연속 안타로
          선취점을 뽑았고, 5회초 투아웃 1, 3루에서 나온 토레스의 우전 적시타로 2대
          0까지 달아났습니다. 6회초엔 선두 타자 에런 저지의 좌익선상 2루타,
          오스틴 웰스의 진루타로 원아웃 3루 기회를 만든 뒤 스탠튼이 중전
          적시타를 폭발해 3대 0으로 벌렸습니다. 무실점으로 호투하던 양키스의
          선발 투수 게릿 콜은 6회말 투아웃에서 보비 위트 주니어, 비니
          파스퀀티노에게 연속 안타를 내줘 3대 1로 추격을 허용했습니다.
          거기까지였습니다. 양키스는 8회 클레이 홈스, 9회 루크 위버가 상대 타선을
          꽁꽁 묶으며 경기를 끝냈습니다. 양키스 1번 타자로 선발 출전한
          토레스는 5타수 2안타 1타점 1득점으로 승리를 이끌었습니다. 선발 투수
          콜은 7이닝을 6피안타 무사사구 4탈삼진 1실점으로 틀어막고 승리투수가
          됐습니다. 같은 날 클리블랜드는 디트로이트와 ALDS 4차전에서 7회에 터진
          대타 데이비드 프라이의 역전 투런포를 앞세워 5대 4로 이겼습니다.
        </p>
      </div>
      <Comments params={params} />
    </div>
  );
};

export default DetailPage;
